[
    {
        "name": "Gayathri's Grit",
        "image": "/assets/ImpactStories/art6.png",
        "year": "2024",
        "volunteer":"Neha",
        "story": "I want to share the story of a little girl, a true fighter who has deeply touched all our hearts here at Lakshya.\n\nShe’s a slow learner, but her enthusiasm, innocence, and radiant smile light up every corner of our centre. Then, one day, she stopped coming. Two weeks passed, and her absence weighed heavily on us. When I called her parents, I learned the truth—she had pneumonia, and it was severe. Her condition was so critical that the doctors had to insert a food pipe to keep her alive. 💔\n\nHer parents were battling unimaginable struggles, and week after week, we waited, prayed, and hoped for her recovery. Time moved painfully slow, and it felt like an eternity. Finally, after four long weeks, our prayers were answered—she survived. 🌟\n\nHer mother told us she wouldn’t return for at least a month to regain her strength. We understood. Her health mattered most.\n\nBut life surprises us in the most beautiful ways. The very next Saturday, to our disbelief, she showed up. 💖 Holding her mother’s hand, her frail body—so fragile after the battle she had fought—stood before us. Her mother, with tears in her eyes, called it nothing short of a miracle. Despite all she had endured, this little girl insisted on coming back because she had missed us, her akka, and her second home.\n\nThe following week, she returned again. Day by day, this little warrior fights her way back, her smile—though thinner—still bright and full of life. 😊\n\nTo me, she is nothing short of a hero. Her story reminds us all that true strength isn’t measured by size or age, but by the courage to keep going when life knocks you down.\n\nIf this child can fight back so fiercely, what’s stopping us? Let’s continue to make a difference, for her and for every child who dares to dream. ✨"  
    },
    {
        "name": "Priya's Progress",
        "image": "/assets/ImpactStories/art4.png",
        "year": "2024",
        "volunteer": "Sanjana",
        "story": "A few weeks into my volunteering journey at U&I, I was mapped to a Story-level kid named Priya, who was studying in 6th grade. We were yet to receive the workbooks, so it was up to us to take the classes. After assessing her knowledge of English grammar, I realized that working on her basics would help her understand advanced concepts in the future. So, we started with Parts of Speech, and every week, I focused on two to three at a time by introducing the concepts using chits.\n\nOne day, I wanted her to understand the difference between Adjectives and Adverbs, as I noticed she was struggling to identify the two in any sentence. So, I wrote a few examples of each, shuffled them, and asked her to first divide the chits into two groups based on whatever made sense to her. She was able to group all the words ending with ‘-ly’ into one and the rest into another. We then started playing with them. I asked her to pick one from each group and make a sentence. She hesitated at first, but by the end of the activity, she was able to frame simple yet meaningful sentences without even realizing that she had understood the concepts.\n\nI came up with similar chit-based activities to teach other Parts of Speech. This experience made me realize how creative teaching, when structured effectively, can help someone grasp a concept more easily. This method of teaching helped her, as she became more confident with Nouns, Pronouns, Verbs, Adjectives, and Adverbs before the Mid-Year Assessment. She also mentioned that she was able to share her knowledge of these topics with her friends, which boosted her self-confidence.\n\nA method that helped her retain these concepts for a longer time was when I first explained them in a language she understood and then repeated the same in English, allowing her to relate and remember them better."
    },
    {
        "name": "Raghu's Journey",
        "image": "/assets/ImpactStories/art2.png",
        "year": "2024",
        "volunteer":"Pranavjeet",
        "story": "Teaching in the LIFT program has been one of the most rewarding experiences of my journey as an educator. One particular moment stands out vividly, reminding me of the profound impact mentorship can have.\n\nWhen I first met Raghu, he was noticeably reserved, hesitant to express his thoughts, and often second-guessed himself. Despite his potential, he seemed unsure of his voice. Over time, through consistent encouragement, open discussions, and collaborative activities, I watched him gradually come out of his shell. However, it wasn't until one special class that I truly witnessed the depth of his transformation.\n\nDuring a debate session that day, Raghu surprised everyone with his remarkable confidence. He spoke clearly and passionately, presenting his arguments with conviction and unwavering self-assurance. He held his ground, engaged thoughtfully with opposing views, and showcased a newfound belief in his own abilities. It was incredible to see this shift from the quiet, hesitant student I had first met to the empowered individual now taking charge of the discussion.\n\nAfter the session, Raghu shared something that deeply moved me — he attributed his growth and confidence to the support and guidance I had provided throughout the program. Hearing those words was, without a doubt, the greatest reward I could have asked for as a teacher.\n\nThis experience reinforced my belief that nurturing self-confidence can unlock incredible potential. It reminded me that sometimes, the most meaningful impact we can make as educators isn't just about what we teach — it's about empowering our students to believe in themselves."
    },
    {
        "name": "From Letters to Words",
        "image": "/assets/ImpactStories/art5.png",
        "year": "2024",
        "volunteer": "Varshitha",
        "story": "I was teaching three letter-level kids at my center, and while they were very smart, they were quite difficult to handle, especially when it came to keeping them seated. Initially, I introduced them to phonetics, but they struggled to understand its importance.\n\nHowever, they quickly picked up the sounds of each letter and were soon able to identify and read simple words. Learning became much easier for them when activities were involved, so I incorporated fun and engaging exercises to encourage active learning.\n\nAarav, Vikram, and Rohan were all incredibly dedicated, and their hard work helped them progress to the word level within the same year.\n\nAt the word level, they learned to read five- to six-letter words, along with some more complex words. I was also able to teach them about nouns, including proper and common nouns.\n\nIt was truly blissful to witness their growth throughout the year."
    },
    {
        "name": "Ragini's Story",
        "image": "/assets/ImpactStories/art3.png",
        "year": "2024",
        "volunteer": "Sohan",
        "story": "When the year began, one of my students struggled with writing. We would try to have writing tasks in the last few minutes of class, but she would shy away from participating or profusely ask me not to include them. \n\nI decided to start by being lenient, asking her to write just a few sentences, and encouraging her to seek support from the other, older kid I was teaching as well. As the year went on, she began writing more confidently. We would do vocabulary exercises every other class and, by the end of the year, had compiled a list of the words they had collectively learned. \n\nIn our last teaching class, I asked her to write an essay in preparation for the impact assessment. She wrote an essay that truly impressed me, even using one of the words we had learned. I read it with a wry smile and definitely a lot of pride."
    },
    {
        "name": "From Silence to Strength",
        "image": "/assets/ImpactStories/art1.png",
        "year": "2024",
        "volunteer":"Prerana",
        "story": "When Swara first joined Lakshya’s Advanced English class in July, she was quiet. She would sit through lessons, listening attentively but rarely interacting. No matter which volunteer she was paired with, the hesitation remained. Sometimes, she would ask to swap volunteers without a clear reason, which was both confusing and, honestly, a little heartbreaking.\n\nBut slowly, things started to change. Week after week, with encouragement and patience, she began opening up. I remember the first time she answered a question—fully in English. Her confidence grew, and so did her voice.\n\nNow, in February, as she moves ahead in LIFT, that transformation is even more evident. I’ve been working with her, helping her open up, and in the process, I’ve seen how much confidence can shape a person. A while ago, she shared something with me that really stuck—she told me how she used to avoid speaking much because it meant speaking in English around her friends and family. She was afraid of making mistakes, being made fun of for her broken English, so she chose silence instead.\n\nBut today? Her father, her friends—everyone around her—is amazed. She speaks in English freely, without hesitation. She doesn’t just answer questions; she starts conversations. She makes jokes, brushes off mistakes, and keeps going.\n\nThis is what U&I is about. I’ve witnessed the power of education transform Swara into someone she always wanted to be. And knowing that I played even a small role in that journey? That’s the most rewarding feeling of all."  
    }
]